CREATE DATABASE Fitness;

GO

USE Fitness

CREATE TABLE PriceList (
ID INT IDENTITY PRIMARY KEY,
Name_of_the_service NVARCHAR(60), --Наименование услуги
Price MONEY --Стоимость
);

INSERT INTO PriceList (Name_of_the_service, Price)
VALUES
('Разовое посещение', 1000),
('Йога', 1800),
('Пилатес', 2900),
('Зумба', 1800),
('Аэробика', 2000),
('Фитнес', 1700),
('Стретчинг', 2300),
('Бодифлекс', 2000),
('Функциональная тренировка', 1500),
('Силовые тренировки', 2100),
('Водные тренировки', 2500),
('Кардио тренировки', 1500);

CREATE TABLE Coach (
ID INT IDENTITY PRIMARY KEY,
Last_name NVARCHAR(60), --Фамилия
First_name NVARCHAR(60), --Имя
Patronymic NVARCHAR(60), --Отчество
Work_experience INT --Стаж работы
);

INSERT INTO Coach (Last_name, First_name, Patronymic, Work_experience)
VALUES
('Иванов', 'Антон', 'Сергеевич', 5),
('Петрова', 'Екатерина', 'Алексеевна',  1),
('Смирнов', 'Дмитрий', 'Владимирович', 7),
('Козлова', 'Наталья', 'Олеговна', 3),
('Морозов', 'Артем', 'Игоревич', 2),
('Лебедева', 'Ольга', 'Викторовна', 4),
('Соколов', 'Александр', 'Иванович', 6),
('Кузнецова', 'Елена', 'Петровна', 7),
('Васильев', 'Игорь', 'Николаевич', 1),
('Новикова', 'Анна', 'Александровна', 9),
('Зайцев', 'Сергей', 'Алексеевич', 3),
('Павлова', 'Татьяна', 'Денисовна', 4),
('Медведев', 'Владимир', 'Анатольевич', 6);

CREATE TABLE Customers (
ID INT IDENTITY PRIMARY KEY,
Last_name NVARCHAR(60), --Фамилия
First_name NVARCHAR(60), --Имя
Patronymic NVARCHAR(60), --Отчество
Bonus_card VARCHAR(60) --Наличие бонусной карты
);

INSERT INTO Customers (Last_name, First_name, Patronymic, Bonus_card)
VALUES
('Козлова', 'Виктория', 'Александровна', 'Да'),
('Петрова', 'Анастасия', 'Ивановна', 'Нет'),
('Смирнова', 'Екатерина', 'Алексеевна', 'Да'),
('Васильева', 'Дарья', 'Сергеевна', 'Да'),
('Михайлова', 'Наталья', 'Дмитриевна', 'Нет'),
('Федорова', 'Марина', 'Андреевна', 'Нет'),
('Морозова', 'Ксения', 'Алексеевна', 'Нет'),
('Иванова', 'Ольга', 'Петровна', 'Нет'),
('Кузнецова', 'Полина', 'Сергеевна', 'Да'),
('Соколова', 'Елена', 'Игоревна', 'Да'),
('Попова', 'Алина', 'Олеговна', 'Нет'),
('Лебедева', 'Валентина', 'Владимировна', 'Нет'),
('Козлова', 'Юлия', 'Анатольевна', 'Нет'),
('Новикова', 'Анна', 'Алексеевна', 'Нет'),
('Морозова', 'Елена', 'Владимировна', 'Нет'),
('Петрова', 'Кристина', 'Игоревна', 'Нет'),
('Смирнова', 'Мария', 'Олеговна', 'Да'),
('Соколова', 'Татьяна', 'Александровна', 'Нет'),
('Кузнецова', 'Диана', 'Сергеевна', 'Нет'),
('Иванова', 'Варвара', 'Васильевна', 'Нет'),
('Федорова', 'Елена', 'Андреевна', 'Да'),
('Попова', 'Наталья', 'Викторовна', 'Да'),
('Морозова', 'Тамара', 'Ивановна', 'Нет'),
('Козлова', 'Ангелина', 'Николаевна', 'Нет'),
('Михайлова', 'Лидия', 'Петровна', 'Нет'),
('Петрова', 'Александра', 'Сергеевна', 'Нет'),
('Смирнова', 'София', 'Александровна', 'Да'),
('Васильева', 'Валерия', 'Дмитриевна', 'Да'),
('Лебедева', 'Алиса', 'Ивановна', 'Да'),
('Кузнецова', 'Кристина', 'Петровна', 'Да'),
('Иванова', 'Дарья', 'Сергеевна', 'Да'),
('Соколова', 'Ирина', 'Алексеевна', 'Нет'),
('Попова', 'Маргарита', 'Олеговна', 'Нет'),
('Морозова', 'Анна', 'Олеговна', 'Да');

CREATE TABLE Timetable (
ID INT IDENTITY PRIMARY KEY,
Visit_time TIME, --Время
Day_of_the_week NVARCHAR(60), --День недели
Hall NVARCHAR(60), --Зал
ID_Coach INT NOT NULL REFERENCES Coach(ID) ON DELETE CASCADE, --ID_Тренера
ID_Name_of_the_service INT NOT NULL REFERENCES PriceList(ID) ON DELETE CASCADE --ID_Наименование_услуги
);

INSERT INTO Timetable (Visit_time, Day_of_the_week, Hall, ID_Coach, ID_Name_of_the_service)
VALUES
('10:00', 'Понедельник', 'Групповой зал', 1, 1),
('12:00', 'Вторник', 'Групповой зал', 2, 2),
('18:00', 'Среда', 'Групповой зал', 3, 3),
('16:00', 'Четверг', 'Групповой зал', 4, 4),
('19:00', 'Пятница', 'Групповой зал', 5, 5),
('11:00', 'Суббота', 'Групповой зал', 6, 6),
('09:00', 'Понедельник', 'Тренажерный зал', 7, 7),
('17:00', 'Вторник', 'Тренажерный зал', 8, 8),
('10:00', 'Среда', 'Тренажерный зал', 9, 9),
('11:00', 'Четверг', 'Тренажерный зал', 10, 10),
('13:00', 'Пятница', 'Бассейн', 11, 11),
('14:00', 'Суббота', 'Кардио зона', 12, 12);

CREATE TABLE Cash (
ID INT IDENTITY PRIMARY KEY,
ID_Name_of_the_service INT REFERENCES PriceList(ID) ON DELETE NO ACTION, --ID_Наименование_услуги
ID_Price INT REFERENCES PriceList(ID) ON DELETE NO ACTION, --ID_Стоимость
ID_Time INT REFERENCES Timetable(ID) ON DELETE NO ACTION, --ID_Время
ID_Customer INT REFERENCES Customers(ID) ON DELETE NO ACTION, --ID_День_недели
ID_Coach INT REFERENCES Coach(ID) ON DELETE NO ACTION, --ID_Клиент
ID_Bonus_card INT REFERENCES Customers(ID) ON DELETE NO ACTION --ID_Бонусная_карта
);

INSERT INTO Cash (ID_Name_of_the_service, ID_Price, ID_Time, ID_Customer, ID_Coach, ID_Bonus_card)
VALUES
(1, 1, 1, 1, 1, 1),
(2, 2, 2, 2, 2, 2),
(3, 3, 3, 3, 3, 3),
(4, 4, 4, 4, 4, 4),
(5, 5, 5, 5, 5, 5),
(6, 6, 6, 6, 6, 6),
(7, 7, 7, 7, 7, 7),
(8, 8, 8, 8, 8, 8),
(9, 9, 9, 9, 9, 9),
(10, 10, 10, 10, 10, 10),
(11, 11, 11, 11, 11, 11),
(12, 12, 12, 12, 12, 12),
(1, 1, 2, 13, 2, 13),
(2, 2, 3, 14, 3, 14),
(3, 3, 4, 15, 4, 15),
(4, 4, 5, 16, 5, 16),
(5, 5, 6, 17, 6, 17),
(6, 6, 7, 18, 7, 18),
(7, 7, 8, 19, 8, 19),
(8, 8, 9, 20, 9, 20),
(9, 9, 10, 21, 10, 21),
(10, 10, 11, 22, 11, 22),
(11, 11, 12, 23, 12, 23),
(12, 12, 1, 24, 1, 24);